<!-- BSV — Brief Skill View | поиск: BSV
Скил   : snr
TL;DR  : Фильтр Сигнал/Шум — скоринг задач, встреч, агентов и документов по SNR-формуле
Вызов  : /snr, "оцени задачи", "meeting gate", "decision memo", "что важно сегодня"
НЕ для : Выполнение задач — только приоритизация и фильтрация
-->

---
name: snr
description: >
  [STATUS: review] [CONFIDENCE: high] [REVIEWED: 2026-04-24]
  Signal/Noise Ratio — методология эссенциализма для эпохи агентного ИИ.
  Скорит задачи, встречи, агентные вызовы и документы по формуле SNR.
  Возвращает: keep / batch / delegate / eliminate + одна фраза почему.
  Триггеры: /snr, "что важно", "оцени задачи", "meeting gate",
  "decision memo", "anti-distortion", "фильтр шума", "приоритеты",
  "snr score", "стоит ли запускать агента", "что удалить из бэклога".
  НЕ использовать для: непосредственного выполнения задач.
---

# SNR Skill — Signal / Noise Ratio

## Зачем

В эпоху агентного ИИ проблема не в нехватке инструментов — а в избытке переключений,
черновиков, координации и фрагментации контекста. Среднее время на одном экране —
47 секунд (Gloria Mark, 2023). 96% компаний не видят AI-ROI потому что AI ускоряет
production, а bottleneck переехал в coordination + rework.

**Правило:** агент не должен производить новый шум быстрее, чем человек успевает его верифицировать.

---

## Формула

```
SNR = Signal Value / Noise Cost

Signal Value = Impact × Compounding × Leverage × Reusability × Confidence
Noise Cost   = Time + Fragmentation + Coordination + Rework + Governance
```

### Шкала 1–5 по каждому параметру

| Параметр | Что оцениваем | Вопрос |
|---|---|---|
| **Impact** | Влияние на ключевой результат | Изменит ли это доход, риск, качество или надёжность? |
| **Compounding** | Накопительный эффект | Эффект будет расти неделями/месяцами? |
| **Leverage** | Сила развилки | Снимает ли это неопределённость для многих следующих шагов? |
| **Reusability** | Переиспользование | Результат станет шаблоном, policy, knowledge asset? |
| **Confidence** | Достоверность входа | Насколько надёжны данные и критерии? |
| **Time** | Чистое время | Сколько часов/минут реально уйдёт? |
| **Fragmentation** | Цена переключений | Сколько раз разорвёт фокус и потребует re-entry? |
| **Coordination** | Согласования | Скольких людей и handoff вовлекает? |
| **Rework** | Вероятность переделки | Насколько вероятно что вернётся на правки? |
| **Governance** | Доступ и контроль | Нужны ли sensitive permissions, аудит, approval? |

### Интерпретация результата

| SNR | Решение |
|---|---|
| **> 8** | **KEEP** — лучший слот внимания, автоматизируй вокруг этого |
| **4–8** | **SIMPLIFY** — оставить, упростить контекст и handoff |
| **2–4** | **BATCH / DELEGATE** — батчить, шаблонизировать, делегировать |
| **< 2** | **ELIMINATE** — удалить, отложить, перенести в low-energy queue |

### Быстрый Python-калькулятор

```python
def snr(impact, compounding, leverage, reusability, confidence,
        time_cost, fragmentation, coordination, rework, governance):
    signal = impact * compounding * leverage * reusability * confidence
    noise = time_cost + fragmentation + coordination + rework + governance
    return round(signal / max(noise, 1), 2)

# Пример: стратегическое решение по архитектуре
print(snr(5,4,5,4,4, 3,1,2,1,2))  # → 53.3 → KEEP
# Пример: срочное письмо "FYI"
print(snr(1,1,1,1,3, 1,3,1,2,1))  # → 0.375 → ELIMINATE
```

---

## Режим 1: Daily Triage — скоринг задач

**Когда:** утром, перед планированием дня, или когда бэклог вышел из-под контроля.

**Промпт:**
```
Ты — SNR-фильтр моего дня.

Входные данные:
1) список задач / бэклог
2) календарь
3) входящие сообщения / письма
4) мой главный outcome на сегодня: [...]

Для каждого элемента:
- оцени Impact, Compounding, Leverage, Reusability, Confidence (1–5)
- оцени Time, Fragmentation, Coordination, Rework, Governance (1–5)
- посчитай SNR
- верни: KEEP / SIMPLIFY / BATCH / ELIMINATE
- одна фраза — почему

В конце:
- 1 главный результат дня
- 2–3 high-SNR задачи
- что удалить чтобы освободить фокус
```

---

## Режим 2: Meeting Gate — фильтр встреч

**Когда:** при планировании встречи или перед weekly/recurring review.

**Промпт:**
```
Ты — meeting gatekeeper.

Для каждой встречи проверь:
- есть ли owner и decision/commitment outcome?
- можно ли решить async?
- нужен ли именно этот состав?
- есть ли pre-read?
- цена встречи в человеко-часах?

Верни:
1) keep / shrink / async / cancel
2) почему (одна фраза)
3) какой минимальный артефакт заменит встречу
```

**Правило Shopify:** встречи с 3+ участниками требуют явного decision outcome.
Нет outcome → async by default.

---

## Режим 3: Decision Memo — сжатие в решение

**Когда:** перед принятием архитектурного решения, при анализе документа,
перед запуском сложного агентного flow.

**Промпт:**
```
Сожми входной материал до decision memo.

Запрещено:
- пересказывать всё подряд
- терять оговорки и исключения
- скрывать неопределённость

Верни только:
- decision to make
- 3 варианта (options)
- tradeoffs для каждого
- unknowns (чего не знаем)
- risks
- recommendation
- what would change the recommendation
```

---

## Режим 4: Anti-Distortion Summary — summary без искажений

**Когда:** при сжатии документа, research-отчёта, wiki-записи, agent output.

**Промпт:**
```
Сделай summary без summary distortion.

Правила:
- не расширяй область применимости вывода
- не убирай квалификаторы, исключения, ограничения
- отдельно перечисли omissions risk
- отдельно пометь unsupported claims
- если данных не хватает — пиши "unknown", не додумывай
```

**Почему важно:** LLM-summaries склонны к omission и overgeneralization.
Automation bias: в экспериментах операторы заменяли верные решения
ошибочным AI-советом в ~7% случаев.

---

## Режим 5: Agent Gate — стоит ли запускать агента?

**Когда:** перед вызовом subagent или запуском сложного tool-chain.

**Чеклист (30 секунд):**

| Вопрос | Если "нет" → |
|---|---|
| Нельзя решить прямым Read/Grep/Bash? | Не запускать агента |
| Нужен реально изолированный контекст? | Не запускать агента |
| Выход агента войдёт в решение, а не в архив? | Не запускать агента |
| Я смогу верифицировать вывод за < 2 мин? | Добавить critique pass |
| Действие необратимо или затрагивает prod? | Требовать approval |

**Правило OpenAI:** сначала выжать максимум из single-agent + tools.
Multi-agent — только при реальной необходимости.
Каждый лишний агент = tool overload + coordination drag.

---

## Режим 6: Essentialist OS — недельный аудит

**Когда:** раз в неделю, Friday review.

**Структура:**
```
1. High-SNR hours за неделю: ___
2. Встречи которые были шумом: ___
3. Задачи которые вернулись на rework: ___
4. AI output который пошёл в корзину: ___
5. Что удалить из бэклога навсегда: ___
6. Один паттерн шума который повторялся: ___
   → сохранить в patterns.md как [AVOID]
```

**Метрики для отслеживания:**

| Горизонт | Метрика |
|---|---|
| День | high-SNR hours, прерываний/час |
| Неделя | meeting hours, decision latency, % задач с outcome |
| Месяц | rework ratio, AI acceptance rate, % reusable artifacts |
| Квартал | top-3 concentration ratio, % снижения low-SNR work |

---

## Двухконтурный шум (запомнить)

**Старый шум:** уведомления, бессистемные встречи, расползшиеся бэклоги.

**Новый шум (агентный):** переизбыток черновиков, лишние агенты, overlapping tools,
synthetic urgency от авто-приоритизации, summary distortion от сжатия.

Проектировать SNR нужно явно — иначе агентный ИИ увеличит throughput
быстрее, чем система успеет переварить его в качественное решение.

---

## Gotchas

- SNR — инструмент judgment, не замена ему. Цифра помогает думать, не думает за тебя.
- "Срочное" ≠ "важное". Срочность — свойство дедлайна. Сигнал — свойство причинного воздействия на результат.
- Рутина ≠ шум. Правильная рутина снижает ошибки и future rework → это сигнал.
- Не скорить всё подряд — только когда есть реальный выбор между задачами.
